georgebenett/gb_receiver/sdkconfig.defaults
# This file was generated using idf.py save-defconfig. It can be edited manually.
# Espressif IoT Development Framework (ESP-IDF) Project Minimal Configuration
#
CONFIG_IDF_TARGET="esp32c3"
CONFIG_BT_ENABLED=y
# CONFIG_BT_BLE_50_FEATURES_SUPPORTED is not set
CONFIG_BT_BLE_42_FEATURES_SUPPORTED=y

# Wi-Fi + BLE coexistence
CONFIG_ESP_COEX_SW_COEXIST_ENABLE=y

# 4 MB flash on production hardware (was defaulting to 2 MB)
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"

# Custom partition table: dual-slot OTA + coredump
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# OTA safety: bootloader rolls back to the previous slot if the new image
# never calls esp_ota_mark_app_valid_cancel_rollback() on first boot.
CONFIG_BOOTLOADER_APP_ROLLBACK_ENABLE=y
